#ifndef MENU_H_INCLUDED
#define MENU_H_INCLUDED
#include "BusMap.h"
void gotoxy(int x, int y);//坐标函数
void HideCursor(int n);//隐藏光标

void LoginScreen();//开机界面
void Shutdown();//关机界面

void MainMenu();//主菜单
//管理员
void LoginScreeForAdministrator();//管理员登录界面
void MenuForAdministrator();//管理员操作界面
void OutPutAllBusName();//输出库中所有公交名及起始站与终点站
void OutPutAllStationName();//输出库中所有站名

void MenuForBus();//操作公交菜单
void AddBus();//添加公交、附带添加其路径
void DeleteBus();//删除公交路线、附带删除其路径
void ChangeBusInfo();//修改公交线路
void ChangeBusName();//修改公交名称
void ChangeBusStartandEnd();//修改公交起点,终点

void MenuForStation();//操作站点菜单
void AddStation();//添加站点
void DeleteStation();//删除站点
void ChangeStationInfo();//修改站点信息

void ChangeInfo();//管理员更改账户、密码
//乘客
void MenuForCustomer();//乘客界面
void OutPutBusRoute();//输出某条库中公交线路
void OutPutStationInf();//输出该站点所经过公交线路
void SearchRoute();//为乘客规划线路最多换乘1次
const char Login[30][200]=
{
    {" ______________________________________________________________________________________________"},
    {"│                                                                                             │"},
    {"│                           ___________________________                                       │"},
    {"│            ____________ // _________________________ \\ __________________                   │"},
    {"│          /   _____________________  │___________│ │      │      │ │      \\ _______          │"},
    {"│         │   │     │      │        │ │  _______  │ │______│______│ │  _____ \\ ---  \\         │"},
    {"│         │   │     │      │________│ │ │   │   │ │ │      │      │ │ │     │ │    \\_\\        │"},
    {"│         │   │_____│______│        │ │ │   │   │ │ │      │      │ │ │     │ │               │"},
    {"│         │   │____________│________│ │ │   │   │ │ │______│______│ │ │     │ │               │"},
    {"│         │                           │ │   │   │ │                 │ │     │ │               │"},
    {"│         │                           │ │   │   │ │                 │ │     │ │               │"},
    {"│         │                 _____     │ │___│___│ │      _____      │ │_____│ │               │"},
    {"│         │________________/ ___ \\____│___________│_____/ ___ \\_____│_________│               │"},
    {"│                           / _ \\                        / _ \\                                │"},
    {"│                           \\___/                        \\___/                                │"},
    {"│                                                                                             │"},
    {"│                                                                                             │"},
    {"│                                                                                             │"},
    {"│                         =============欢迎使用公交管理系统=============                      │"},
    {"│                                                                                             │"},
    {"│                              _____________________________________                          │"},
    {"│                             │                                    │                          │"},
    {"│                             └────────────────────────────────────┘                          │"},
    {"│                                                                                             │"},
    {"│                         ==============================================                      │"},
    {"│                                                                                             │"},
    {"│                                                                                             │"},
    {"└─────────────────────────────────────────────────────────────────────────────────────────────┘"}
};
const char Shut[15][100]=
{
    {"                    *                         *                             *                  "},
    {"                  *  *                      *  *                          *  *                 "},
    {"                 *   *                     *   *                         *   *                 "},
    {"               **   *                    **   *                        **   *                  "},
    {"        ***  **    *********      ***  **    *********          ***  **    *********           "},
    {"        ***  **          **       ***  **          **           ***  **          **            "},
    {"        ***  **         **        ***  **         **            ***  **         **             "},
    {"        ***  **        **         ***  **        **             ***  **        **              "},
    {"        ***  **********           ***  **********               ***  **********                "},
    {"                                                                                               "},
    {"                                                                                               "},
    {"                                                                                               "},
    {"                     感谢您的使用,再见!正在关机中                                              "}
};
#endif // MENU_H_INCLUDED
